Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: For information on creating and using an :term:`Initramfs`, see the ":ref:`dev-manual/building:building an initial ram filesystem (Initramfs) image`" section in the Yocto Project Development Tasks Manual.
it_it: Per informazioni sulla creazione e l'utilizzo di un :term:`Initramfs`, consultare la sezione ":ref:`dev-manual/building:building an initial ram filesystem (Initramfs) image`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: For information on finding out who is responsible for (maintains) a particular area of code in the Yocto Project, see the ":doc:`/contributor-guide/identify-component`" section of the Yocto Project and OpenEmbedded Contributor Guide.
it_it: Per informazioni su come individuare chi è responsabile (mantiene) una particolare area di codice in Yocto Project, consultare la sezione ":doc:`/contributor-guide/identify-component`" della Guida per i Collaboratori di Yocto Project e di OpenEmbedded.

source: For information on how BitBake uses stamp files to determine if a task should be rerun, see the ":ref:`overview-manual/concepts:stamp files and the rerunning of tasks`" section in the Yocto Project Overview and Concepts Manual.
it_it: Per informazioni su come BitBake utilizza i file di timestamp per determinare se un task deve essere rieseguito, consultare la sezione ":ref:`overview-manual/concepts:stamp files and the rerunning of tasks`" nel Manuale Introduttivo e Concetti di Yocto Project.

source: For information on how to have the OpenEmbedded build system generate tarballs for Git repositories and place them in the :term:`DL_DIR` directory, see the :term:`BB_GENERATE_MIRROR_TARBALLS` variable in the Yocto Project Reference Manual.
it_it: Per informazioni su come fare in modo che il sistema di build OpenEmbedded generi tarball per i repository Git e li posizioni nella directory :term:`DL_DIR`, consultare la variabile :term:`BB_GENERATE_MIRROR_TARBALLS` nel Manuale di Riferimento di Yocto Project.

source: For information on how to set up a Build Host on a system running Linux as its native operating system, see the ":ref:`dev-manual/start:setting up a native linux host`" section in the Yocto Project Development Tasks Manual.
it_it: Per informazioni su come configurare un Build Host su un sistema che esegue Linux come sistema operativo nativo, consultare la sezione ":ref:`dev-manual/start:setting up a native linux host`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: For information on how to set up a Build Host with WSL 2, see the ":ref:`dev-manual/start:setting up to use windows subsystem for linux (wsl 2)`" section in the Yocto Project Development Tasks Manual.
it_it: Per informazioni su come configurare un Build Host con WSL 2, consultare la sezione ":ref:`dev-manual/start:setting up to use windows subsystem for linux (wsl 2)`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: For information on setting up a cross-development environment, see the :doc:`/sdk-manual/index` manual.
it_it: Per informazioni sulla configurazione di un ambiente di sviluppo cross-development, consultare il manuale :doc:`/sdk-manual/index`.

source: For information on the eSDK, see the :doc:`/sdk-manual/index` Manual.
it_it: er informazioni sull'eSDK, consultare il manuale :doc:`/sdk-manual/index`.

source: For information on the eSDK, see the :doc:`/sdk-manual/index` manual.
it_it: Per informazioni sull'eSDK, consultare il manuale :doc:`/sdk-manual/index`.

source: For information on typical BSP development workflow, see the :ref:`bsp-manual/bsp:developing a board support package (bsp)` section. For more information on how to set up a local copy of source files from a Git repository, see the :doc:`/dev-manual/poky-manual-setup` section in the Yocto Project Development Tasks Manual.
it_it: Per informazioni sul tipico flusso di lavoro di sviluppo BSP, consultare la sezione :ref:`bsp-manual/bsp:developing a board support package (bsp)`. Per ulteriori informazioni su come configurare una copia locale dei file sorgente da un repository Git, consultare la sezione :doc:`/dev-manual/poky-manual-setup` nel Manuale di Sviluppo dei Task di Yocto Project.

source: For information on using the ``bitbake`` command, see the :ref:`overview-manual/concepts:bitbake` section in the Yocto Project Overview and Concepts Manual, or see :ref:`bitbake-user-manual/bitbake-user-manual-intro:the bitbake command` in the BitBake User Manual.
it_it: Per informazioni sull'utilizzo del comando ``bitbake``, consulta la sezione :ref:`overview-manual/concepts:bitbake` nel Manuale Introduttivo e Concetti di Yocto Project, oppure consultare :ref:`bitbake-user-manual/bitbake-user-manual-intro:the bitbake command` nel Manuale Utente di BitBake.

source: For information on variables affecting sstate, see the :term:`SSTATE_DIR` and :term:`SSTATE_MIRRORS` variables.
it_it: Per informazioni sulle variabili che influenzano sstate, consultare le variabili :term:`SSTATE_DIR` e :term:`SSTATE_MIRRORS`.

source: For information that can help you maintain compliance with various open source licensing during the lifecycle of a product created using the Yocto Project, see the ":ref:`dev-manual/licenses:maintaining open source license compliance during your product's lifecycle`" section in the Yocto Project Development Tasks Manual.
it_it: Per informazioni che possono aiutare a mantenere la conformità con le varie licenze open source durante il ciclo di vita di un prodotto creato utilizzando Yocto Project, consultare la sezione ":ref:`dev-manual/licenses:maintaining open source license compliance during your product's lifecycle`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: For introductory information on layers, see the ":ref:`overview-manual/yp-intro:The Yocto Project Layer Model`" section in the Yocto Project Overview and Concepts Manual. For more detailed information on layers, see the ":ref:`dev-manual/layers:Understanding and Creating Layers`" section in the Yocto Project Development Tasks Manual. For a discussion specifically on BSP Layers, see the ":ref:`bsp-manual/bsp:BSP Layers`" section in the Yocto Project Board Support Packages (BSP) Developer's Guide.
it_it: Per informazioni introduttive sui layer, consultare la sezione ":ref:`overview-manual/yp-intro:The Yocto Project Layer Model`" nel Manuale Introduttivo e Concetti di Yocto Project. Per informazioni più dettagliate sui layer, consultare la sezione ":ref:`dev-manual/layers:Understanding and Creating Layers`" nel Manuale di Sviluppo dei Task di Yocto Project. Per una discussione specifica sui layer BSP, consultare la sezione ":ref:`bsp-manual/bsp:BSP Layers`" nella Guida degli Sviluppatori di Board Support Packages (BSP) di Yocto Project.

source: For introductory information on the Yocto Project, see the :yocto_home:`Yocto Project Website <>` and the ":ref:`overview-manual/development-environment:the yocto project development environment`" chapter in the Yocto Project Overview and Concepts Manual.
it_it: Per informazioni introduttive su Yocto Project, consultate il :yocto_home:`Sito Web di Yocto Project <>` e il capitolo ":ref:`overview-manual/development-environment:the yocto project development environment`" nel Manuale Introduttivo e Concetti di Yocto Project.

source: For larger patch series it is preferable to send a pull request which not only includes the patch but also a pointer to a branch that can be pulled from. This involves making a local branch for your changes, pushing this branch to an accessible repository and then using the ``create-pull-request`` and ``send-pull-request`` scripts from openembedded-core to create and send a patch series with a link to the branch for review.
it_it: Per serie di patch più ampie, è preferibile inviare una pull request che includa non solo la patch, ma anche un puntatore a un branch da cui prelevare le modifiche. Questo comporta la creazione di un branch locale per le modifiche, il push di questo branch in un repository accessibile e quindi l'utilizzo degli script ``create-pull-request`` e ``send-pull-request`` di openembedded-core per creare e inviare una serie di patch con un link al branch per la revisione.

source: For more detailed information on layers, see the ":ref:`dev-manual/layers:understanding and creating layers`" section in the Yocto Project Development Tasks Manual. For a discussion specifically on BSP Layers, see the ":ref:`bsp-manual/bsp:bsp layers`" section in the Yocto Project Board Support Packages (BSP) Developer's Guide.
it_it: Per informazioni più dettagliate sui layer, consultare la sezione ":ref:`dev-manual/layers:understanding and creating layers`" nel Manuale di Riferimento di Yocto Project. Per una discussione specifica sui layer BSP, consultare la sezione ":ref:`bsp-manual/bsp:bsp layers`" nella Guida degli Sviluppatori di Board Support Packages (BSP) di Yocto Project.

source: For more details on fragments, see:
it_it: Per maggiori dettagli sui frammenti, consultare:

source: For more details on the source :ref:`ref-classes-archiver`, see the ":ref:`dev-manual/licenses:maintaining open source license compliance during your product's lifecycle`" section in the Yocto Project Development Tasks Manual. You can also see the :term:`ARCHIVER_MODE` variable for information about the variable flags (varflags) that help control archive creation.
it_it: Per maggiori dettagli sulla classe sorgente :ref:`ref-classes-archiver`, consultare la sezione ":ref:`dev-manual/licenses:maintaining open source license compliance during your product's lifecycle`" nel Manuale di Sviluppo dei Task di Yocto Project. È inoltre possibile consultare la variabile :term:`ARCHIVER_MODE` per informazioni sui flag variabili (varflags) che consentono di controllare la creazione dell'archivio.

source: For more information about the Yocto Project Documentation set, see the :ref:`ref-manual/resources:links and related documentation` section.
it_it: Per ulteriori informazioni sulla documentazione di Yocto Project, consultare la sezione :ref:`ref-manual/resources:links and related documentation`.

source: For more information on BitBake, see the :doc:`BitBake User Manual <bitbake:index>`.
it_it: Per ulteriori informazioni su BitBake, consultare il :doc:`Manuale Utente di BitBake <bitbake:index>`.

source: For more information on Git, see https://git-scm.com/docs.
it_it: Per ulteriori informazioni su Git, consultare https://git-scm.com/docs.

source: For more information on how the SPL variables are used, see the :oe_git:`u-boot.inc </openembedded-core/tree/meta/recipes-bsp/u-boot/u-boot.inc>` include file.
it_it: Per ulteriori informazioni sull'utilizzo delle variabili SPL, consultare il file di inclusione :oe_git:`u-boot.inc </openembedded-core/tree/meta/recipes-bsp/u-boot/u-boot.inc>`.

source: For more information on how the source directories are created, see the ":ref:`overview-manual/concepts:source fetching`" section. For more information on how to create patches and how the build system processes patches, see the ":ref:`dev-manual/new-recipe:patching code`" section in the Yocto Project Development Tasks Manual. You can also see the ":ref:`dev-manual/devtool:use \`\`devtool modify\`\` to modify the source of an existing component`" section in the Yocto Project Application Development and the Extensible Software Development Kit (SDK) manual and the ":ref:`kernel-dev/common:using traditional kernel development to patch the kernel`" section in the Yocto Project Linux Kernel Development Manual.
it_it: Per ulteriori informazioni su come vengono create le directory dei sorgenti, consultare la sezione ":ref:`overview-manual/concepts:source fetching`". Per ulteriori informazioni su come creare le patch e su come il sistema di compilazione le elabora, consultare la sezione ":ref:`dev-manual/new-recipe:patching code`" nel Manuale di Sviluppo dei Task di Yocto Project. È inoltre possibile consultare la sezione ":ref:`dev-manual/devtool:use \`\`devtool modify\`\` to modify the source of an existing component`" nel Manuale di Sviluppo di Applicazioni Yocto Project e Software Development Kit (SDK) e la sezione ":ref:`kernel-dev/common:using traditional kernel development to patch the kernel`" nel Manuale di Sviluppo del Kernel Linux di Yocto Project.

source: For more information on how to use ``bitbake-setup``, see the :doc:`/brief-yoctoprojectqs/index` document.
it_it: Per ulteriori informazioni su come utilizzare ``bitbake-setup``, consultare il documento :doc:`/brief-yoctoprojectqs/index`.

source: For more information on how to use these variables, see the ":ref:`dev-manual/customizing-images:Customizing Images Using Custom \`\`IMAGE_FEATURES\`\` and \`\`EXTRA_IMAGE_FEATURES\`\``" section. For information on the variables, see :term:`IMAGE_FEATURES` and :term:`EXTRA_IMAGE_FEATURES`.
it_it: Per ulteriori informazioni sull'utilizzo di queste variabili, consultare la sezione ":ref:`dev-manual/customizing-images:Customizing Images Using Custom \`\`IMAGE_FEATURES\`\` and \`\`EXTRA_IMAGE_FEATURES\`\``". Per informazioni sulle variabili, consultare i documenti :term:`IMAGE_FEATURES` e :term:`EXTRA_IMAGE_FEATURES`.

source: For more information on layers and how to create them, see the :ref:`dev-manual/layers:Creating Your Own Layer` section in the Yocto Project Development Tasks Manual.
it_it: Per ulteriori informazioni sui layer e su come crearli, consultare la sezione :ref:`dev-manual/layers:Creating Your Own Layer` nel Manuale di Sviluppo dei Task di Yocto Project.

source: For more information on layers, see the ":ref:`dev-manual/layers:understanding and creating layers`" section of the Yocto Project Development Tasks Manual.
it_it: Per ulteriori informazioni sui layer, consultare la sezione ":ref:`dev-manual/layers:understanding and creating layers`" del Manuale di Sviluppo dei Task di Yocto Project.

source: For more information on public key cryptography, see :wikipedia:`Public-key_cryptography`.
it_it: Per ulteriori informazioni sulla crittografia a chiave pubblica, consultare la pagina di Wikipedia :wikipedia:`Public-key_cryptography`.

source: For more information on the ``oe-pkgdata-util`` utility, see the section :ref:`dev-manual/debugging:Viewing Package Information with ``oe-pkgdata-util``` of the Yocto Project Development Tasks Manual.
it_it: Per ulteriori informazioni sull'utilità ``oe-pkgdata-util``, consultare la sezione :ref:`dev-manual/debugging:Viewing Package Information with ``oe-pkgdata-util``` del Manuale di Sviluppo dei Task di Yocto Project.

source: For more information on the alternatives system, see the ":ref:`ref-classes-update-alternatives`" section.
it_it: Per ulteriori informazioni sul sistema di alternative, consultare la sezione ":ref:`ref-classes-update-alternatives`".

source: For more information on the cross-development toolchain generation, see the ":ref:`overview-manual/concepts:cross-development toolchain generation`" section. For information on advantages gained when building a cross-development toolchain using the :ref:`ref-tasks-populate_sdk` task, see the ":ref:`sdk-manual/appendix-obtain:building an sdk installer`" section in the Yocto Project Application Development and the Extensible Software Development Kit (eSDK) manual.
it_it: Per ulteriori informazioni sulla generazione della toolchain di cross-sviluppo, consultare la sezione ":ref:`overview-manual/concepts:cross-development toolchain generation`". Per informazioni sui vantaggi derivanti dalla creazione di una toolchain di cross-sviluppo tramite il task :ref:`ref-tasks-populate_sdk`, consultare la sezione ":ref:`sdk-manual/appendix-obtain:building an sdk installer`" in the nel Manuale di Sviluppo di Applicazioni Yocto Project e Software Development Kit (eSDK).

source: For more information, see the :term:`FAKEROOT* <bitbake:FAKEROOT>` variables in the BitBake User Manual. You can also reference the "`Why Not Fakeroot? <https://github.com/wrpseudo/pseudo/wiki/WhyNotFakeroot>`__" article for background information on Fakeroot and Pseudo.
it_it: Per ulteriori informazioni, consultare le variabili :term:`FAKEROOT* <bitbake:FAKEROOT>` nel Manuale Utente di BitBake. Per ulteriori informazioni su Fakeroot e Pseudo, si può anche consultare l'articolo "`Why Not Fakeroot? <https://github.com/wrpseudo/pseudo/wiki/WhyNotFakeroot>`__".

source: For non-default database configurations, it is possible that you can use ``manage.py`` commands from a directory other than the :term:`Build Directory`. To do so, the ``toastermain/settings.py`` file must be configured to point to the correct database backend.
it_it: Per configurazioni di database non predefinite, è possibile utilizzare i comandi ``manage.py`` da una directory diversa da :term:`Build Directory`. A tal fine, il file ``toastermain/settings.py`` deve essere configurato in modo da puntare al backend del database corretto.

source: For procedures on how to create layers, see the ":ref:`dev-manual/layers:understanding and creating layers`" section in the Yocto Project Development Tasks Manual.
it_it: Per le procedure su come creare layer, consultare la sezione ":ref:`dev-manual/layers:understanding and creating layers`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: For recipes whose version uses a dot-separated scheme, the :ref:`ref-classes-upstream-stable-release-point` class can automatically generate this regex. For other versioning schemes, set :term:`UPSTREAM_STABLE_RELEASE_REGEX` directly in the recipe.
it_it: Per le ricette la cui versione utilizza uno schema separato da punti, la classe :ref:`ref-classes-upstream-stable-release-point` può generare automaticamente questa espressione regolare. Per altri schemi di versioning, impostare :term:`UPSTREAM_STABLE_RELEASE_REGEX` direttamente nella ricetta.

source: For reference information on classes, see the ":doc:`/ref-manual/classes`" chapter.
it_it: Per informazioni di riferimento sulle classi, consultare il capitolo ":doc:`/ref-manual/classes`".

source: For secure communications, please send your messages encrypted using the GPG keys. Remember, message headers are not encrypted so do not include sensitive information in the subject line.
it_it: Per comunicazioni sicure, si prega di inviare i messaggi crittografati utilizzando le chiavi GPG. Ricordate che le intestazioni dei messaggi non sono crittografate, quindi non includete informazioni sensibili nell'oggetto.

source: For some historical information about Poky, see the :term:`Poky` term.
it_it: Per informazioni storiche su Poky, consultare il termine :term:`Poky`.

source: For stable branches, we want to avoid API (Application Programming Interface) or ABI (Application Binary Interface) breakages. When submitting an update, a minor version update of a component is preferred if the version is backward-compatible. Many software components have backward-compatible stable versions, with a notable example of the Linux kernel. However, if the new version does or likely might introduce incompatibilities, extracting and backporting patches is preferred.
it_it: Per i branch stabili, è preferibile evitare incompatibilità con le API (Application Programming Interface) o le ABI (Application Binary Interface). Quando si invia un aggiornamento, è preferibile un aggiornamento a una versione minore del componente se la versione è retrocompatibile. Molti componenti software hanno versioni stabili retrocompatibili, con un esempio notevole del kernel Linux. Tuttavia, se la nuova versione introduce o potrebbe introdurre incompatibilità, è preferibile estrarre e applicare le patch.

source: For steps that show you how to set up your development host to use Toaster and on how to use Toaster in general, see the :doc:`/toaster-manual/index`.
it_it: Per le istruzioni su come configurare l'host di sviluppo per utilizzare Toaster e su come utilizzare Toaster in generale, consultare il :doc:`/toaster-manual/index`.

source: For structural information on BSPs, see the :ref:`bsp-manual/bsp:example filesystem layout` section.
it_it: Per informazioni sulla struttura dei BSP, consultare la sezione :ref:`bsp-manual/bsp:example filesystem layout`.

source: For subsequent parsing and processing, the name of the Build directory is available via the :term:`TOPDIR` variable.
it_it: Per le successive analisi ed elaborazioni, il nome della directory di Build è disponibile tramite la variabile :term:`TOPDIR`.

source: For systems with a broken make version (e.g. make 4.2.1 without patches) but where the rest of the host tools are usable, you can use the :term:`buildtools-make` tarball instead.
it_it: Per i sistemi con una versione di make non funzionante (ad esempio make 4.2.1 senza patch) ma in cui gli altri strumenti host sono utilizzabili, è possibile utilizzare il tarball :term:`buildtools-make`.

source: For the Yocto Project, a key individual called the "maintainer" is responsible for the integrity of the development branch of a given Git repository. The development branch is the "upstream" repository from which final or most recent builds of a project occur. The maintainer is responsible for accepting changes from other developers and for organizing the underlying branch structure to reflect release strategies and so forth.
it_it: In Yocto Project, una figura chiave, chiamata "maintainer", è responsabile dell'integrità del branch di sviluppo di un determinato repository Git. Il branch di sviluppo è il repository "upstream" da cui vengono generate le build finali o più recenti di un progetto. Il responsabile della manutenzione ha il compito di accettare le modifiche da altri sviluppatori e di organizzare la struttura dei branch sottostante in modo che rifletta le strategie di rilascio e così via.

source: For the commit description, provide detailed information that describes what you changed, why you made the change, and the approach you used. It might also be helpful if you mention how you tested the change. Provide as much detail as you can in the commit description.
it_it: Nella descrizione del commit, fornire informazioni dettagliate che descrivano cosa è stato modificato, perché è stato fatto e l'approccio che utilizzato. Potrebbe anche essere utile menzionare come è stata testato la modifica. Fornire il maggior numero possibile di dettagli nella descrizione del commit.

source: For the correct operations of :ref:`ref-classes-sbom-cve-check`, it requires the CVE identification in a ``CVE:`` tag of the patch file commit message using the format::
it_it: Per il corretto funzionamento di :ref:`ref-classes-sbom-cve-check`, è necessario includere l'identificativo CVE nel tag ``CVE:`` del messaggio di commit del file patch, utilizzando il seguente formato::

source: For the extended installer::
it_it: Per l'installazione estesa::
